---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PropertySetElementFailures.EmptyPropertySetName
source: html/6a0608d5-5d7b-a020-099c-32e7f10e8916.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PropertySetElementFailures.EmptyPropertySetName Property

A property set name cannot be an empty string.

## Syntax (C#)
```csharp
public static FailureDefinitionId EmptyPropertySetName { get; }
```